"""
Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.

Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. Начиная с 1 и 2, первые 10 элементов будут:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.

"""
""""
#n = int(input("Enter the value of 'n:'  "))
n = 4000000
a = 0
b = 1
sum = 0
count = 1
print("Fabonacci series:", end = "")
while (count<=n):
    print(sum, end = "")
    count +=1
    a = b    
    b = sum
    sum = a + b

"""

"""
f=[1,2]
i=2
a=0
while f[i]<4000000:
    f.append(f[i-1]+f[i-2])
    i+=1
    a=f[i]
res=filter(lambda x:x%2==0, f)
print(sum(res))
"""
x1 = 0
x2 = 1
sum = 0
while sum<4000000:
    x3 = x1 + x2
    if x3%2==0:
        sum +=x3
    x1 = x2
    x2 = x3

print(sum)